{
  "tips": [
    {
      "id": "high-altitude-muffins",
      "category": "baking",
      "title": "High Altitude Muffin Baking",
      "tip": "For high altitude baking, increase oven temperature from 400°F to 425°F for muffins.",
      "source": "Bisquick box recipe"
    },
    {
      "id": "high-altitude-dumplings",
      "category": "baking",
      "title": "High Altitude Dumplings",
      "tip": "For high altitude, no adjustments needed for dumplings.",
      "source": "Bisquick box recipe"
    },
    {
      "id": "high-altitude-biscuits",
      "category": "baking",
      "title": "High Altitude Drop Biscuits",
      "tip": "For high altitude, heat oven to 475°F (instead of 450°F). If using water, increase baking mix to 2 1/2 cups.",
      "source": "Bisquick box recipe"
    },
    {
      "id": "microwave-reheat-biscuits",
      "category": "reheating",
      "title": "Microwave Reheat Frozen Biscuits",
      "tip": "Arrange frozen biscuits on paper towel on microwavable plate. Cover with paper towel and microwave on medium (50%): 2 biscuits 1-1.5 min, 4 biscuits 1.5-2 min, 6 biscuits 2-2.5 min.",
      "source": "Bisquick box recipe"
    },
    {
      "id": "high-altitude-pumpkin-pie",
      "category": "baking",
      "title": "High Altitude Pumpkin Pie (3,500-6,000 ft)",
      "tip": "For deep-dish pumpkin pie at high altitude, extend second bake time to 55-65 minutes. For shallow pies, no change needed.",
      "source": "Libby's Pumpkin Pie Mix"
    },
    {
      "id": "pumpkin-pie-storage",
      "category": "storage",
      "title": "How to Store Pumpkin Pie",
      "tip": "After baking, pie should be left at room temperature for 2 hours and then refrigerated for 2-3 days.",
      "source": "Libby's Pumpkin Pie Mix FAQ"
    },
    {
      "id": "pumpkin-pie-doneness-test",
      "category": "baking",
      "title": "How to Test if Pumpkin Pie is Done",
      "tip": "Insert a knife about 1 to 1 1/2 inches from the edge of the pie. If it comes out clean, or if tiny bubbles around the edge of the pie or filling separate, remove the pie from the oven immediately.",
      "source": "Libby's Pumpkin Pie Mix FAQ"
    },
    {
      "id": "egg-substitute-pumpkin-pie",
      "category": "substitutions",
      "title": "Egg Substitutes in Pumpkin Pie",
      "tip": "Egg substitutes produce an acceptable pie; however the flavor of the spices may be affected because the finished pie texture will be too soft.",
      "source": "Libby's Pumpkin Pie Mix FAQ"
    },
    {
      "id": "make-ahead-pumpkin-pie",
      "category": "make-ahead",
      "title": "Preparing Pumpkin Pie in Advance",
      "tip": "Pumpkin Pie is a custard type pie and freezing is not recommended. However, you can prepare the pie shell ahead of time and freeze separately for up to one month. Defrost, ensure filling ingredients are well mixed, then pour into the frozen crust and bake as usual.",
      "source": "Libby's Pumpkin Pie Mix FAQ"
    },
    {
      "id": "pumpkin-pie-mix-storage",
      "category": "storage",
      "title": "Storing Pumpkin Pie Mix/Filling",
      "tip": "Unbaked pie mix/filling can be stored in an airtight container for 1 week in the refrigerator or up to 3 months in the freezer. The mix may expand when frozen and may separate, but this will not affect quality or performance. If using a glass pie plate, defrost the crust as well before baking.",
      "source": "Libby's Pumpkin Pie Mix FAQ"
    },
    {
      "id": "muffin-mixing-method",
      "category": "baking",
      "title": "Proper Muffin Mixing Method",
      "tip": "Combine dry ingredients into bowl; make a well. Combine beaten egg, milk, and melted shortening (cooled slightly). Add to dry ingredients all at once. Stir quickly just until moistened - overmixing causes tough muffins.",
      "source": "General muffin instructions clipping"
    },
    {
      "id": "muffin-overmixing-signs",
      "category": "baking",
      "title": "Signs of Overmixed Muffin Batter",
      "tip": "If batter is overbeaten, muffins will have peaks on top, dull crusts, and tunneled texture. Stir batter only until just moistened for best results.",
      "source": "General muffin instructions clipping"
    },
    {
      "id": "keeping-muffins-warm",
      "category": "serving",
      "title": "Keeping Muffins Warm",
      "tip": "If muffins have to wait, tip to one side to prevent soggy crusts. To keep warm or reheat muffins, wrap in foil and heat in 400°F oven for 15-20 minutes.",
      "source": "General muffin instructions clipping"
    },
    {
      "id": "muffin-cleanup-tip",
      "category": "baking",
      "title": "Easy Muffin Cleanup",
      "tip": "Make cleanup easy by lining muffin tin with paper bake cups.",
      "source": "General muffin instructions clipping"
    },
    {
      "id": "soften-cream-cheese-microwave",
      "category": "prep",
      "title": "How to Soften Cream Cheese",
      "tip": "Place completely unwrapped package of cream cheese in microwaveable bowl. Microwave on HIGH 10 sec. or just until softened.",
      "source": "Philadelphia Cream Cheese packaging"
    },
    {
      "id": "microwave-melt-chocolate",
      "category": "microwave",
      "title": "Melting Chocolate in Microwave",
      "tip": "In a bowl, micro-cook chocolate, uncovered, on 100% power (high) 1 to 2 minutes for 1 square (1 ounce) (1 1/2 to 2 1/2 minutes for one 6-ounce package [1 cup] chocolate pieces) or till soft enough to stir smooth, stirring every minute.",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-melt-butter",
      "category": "microwave",
      "title": "Melting Butter/Margarine in Microwave",
      "tip": "In a bowl, micro-cook butter/margarine, uncovered, on 100% power (high) 40 to 50 seconds for 2 tablespoons, 45 to 60 seconds for 1/4 cup, or 1 to 2 minutes for 1/2 cup.",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-soften-butter",
      "category": "microwave",
      "title": "Softening Butter/Margarine in Microwave",
      "tip": "In a bowl, heat margarine/butter, uncovered, on 10% power (low) 1 to 1 1/2 minutes for 1/2 cup or till softened.",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-soften-cream-cheese-detailed",
      "category": "microwave",
      "title": "Softening Cream Cheese in Microwave (Detailed)",
      "tip": "In a bowl, heat cream cheese, uncovered, on 100% power (high) 15 to 30 seconds for 3 ounces (45 to 60 seconds for 8 ounces) or till softened.",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-reheat-muffins",
      "category": "microwave",
      "title": "Reheating Muffins and Rolls",
      "tip": "Place muffins or rolls on a plate. Heat, uncovered, on 100% power (high) 15 to 20 seconds for 1 or 2 muffins (30 to 60 seconds for 4 muffins).",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-heat-syrup",
      "category": "microwave",
      "title": "Heating Pancake Syrup",
      "tip": "Heat, uncovered, on 100% power (high) 30 to 60 seconds for 1/2 cup syrup (1 to 1 1/2 minutes for 1 cup syrup) or till warm.",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-soften-ice-cream",
      "category": "microwave",
      "title": "Softening Ice Cream",
      "tip": "Heat 1 pint solidly frozen ice cream in a container, uncovered, on 100% power (high) for 15 seconds or till soft.",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-heat-canned-soup",
      "category": "microwave",
      "title": "Heating Canned Soups",
      "tip": "In a bowl, combine one 10- to 11-ounce can condensed soup and 1 soup can water. Micro-cook, uncovered, on 100% power (high) for 2 1/2 to 3 1/2 minutes or till hot.",
      "source": "Microwave reference chart"
    },
    {
      "id": "microwave-juice-lemons",
      "category": "microwave",
      "title": "Juicing Lemons",
      "tip": "Halve or quarter 1 lemon. Heat on 100% power (high) for 30 to 45 seconds. Squeeze out juice.",
      "source": "Microwave reference chart"
    },
    {
      "id": "bread-machine-liquid-adjustment",
      "category": "bread machine",
      "title": "Bread Machine Liquid Adjustment",
      "tip": "Altitude, weather conditions, and accuracy in measurement can affect the outcome of a loaf. Begin using the smaller amount of liquid. Allow bread maker to mix ingredients for a few minutes before checking dough consistency. If dough is dense, oddly shaped, or unit is making a knocking noise, add 1 Tbsp. water at a time until the dough is soft and pliable. Do not exceed 4-1/2 cups dry ingredients.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "sourdough-glass-container",
      "category": "sourdough",
      "title": "Sourdough Starter Container",
      "tip": "Always make starter in a glass container. Never store in metal containers or use metal utensils. The starter will react with the metal.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "sourdough-room-temp",
      "category": "sourdough",
      "title": "Sourdough Temperature",
      "tip": "All ingredients, including starter, should be at room temperature (70°F-80°F/21°C-27°C). Cold ingredients will slow down the activity of the yeast.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "sourdough-replenish",
      "category": "sourdough",
      "title": "Replenishing Sourdough Starter",
      "tip": "When removing starter, always replenish it. Let stand at room temperature for 3 to 5 hours, until bubbles start to form. Cover and refrigerate.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "sourdough-separation",
      "category": "sourdough",
      "title": "Sourdough Starter Separation",
      "tip": "If starter separates (liquid forms on surface), stir until blended before using.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "sourdough-pink-discard",
      "category": "sourdough",
      "title": "When to Discard Sourdough Starter",
      "tip": "If the liquid that forms on surface of starter turns pink in color at any time, discard the starter and start over again with fresh ingredients.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "sourdough-bread-machine-yeast",
      "category": "sourdough",
      "title": "Sourdough in Bread Machine",
      "tip": "IMPORTANT: Sourdough bread made in an automatic breadmaker requires the addition of yeast. The starter's strength and the rising times in the breadmaker are not sufficient to allow for proper rising without the use of additional yeast.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "bread-machine-quick-bread",
      "category": "bread machine",
      "title": "Quick Bread in Bread Machine",
      "tip": "Unlike yeast breads, quick breads do not use yeast as the rising agent. The knead and rise cycles are omitted. Instead, quick breads use baking powder or baking soda along with steam as leavening. Select Quick Bread setting, let mix for 5 minutes, scrape down sides with rubber spatula. When finished, let cool in pan 5 minutes before removing to wire rack. Cool completely before slicing.",
      "source": "Bread machine recipe book"
    },
    {
      "id": "bread-machine-dough-setting",
      "category": "bread machine",
      "title": "Using Dough Setting",
      "tip": "Press Select button to reach dough setting. Press 'Start/Stop'. When dough is ready, the unit will signal and display reads 0:00. Press 'Start/Stop' holding it down until you hear a beep. To remove the bread pan, grasp handle firmly and lift pan out. NOTE: The pan does not get hot when using the dough setting.",
      "source": "Bread machine recipe book, page 35"
    },
    {
      "id": "preparing-dough-for-baking",
      "category": "bread machine",
      "title": "Preparing Dough for Baking",
      "tip": "1) Lightly sprinkle all-purpose flour onto a pastry mat or board. Using a rubber spatula or wooden spoon, remove dough from the bread pan and place on lightly floured surface. Knead by hand 2 or 3 times to release the air. If the dough is easy to handle without flour, shape on a lightly oiled, clean countertop. 2) Shape dough into your favourite rolls, coffee cake, etc. Place on greased baking pan. Cover dough with a clean cloth and let rise until almost doubled in size, about 1 hour. 3) Bake as directed in the recipe. Remove from pan and cool on a wire rack or serve warm.",
      "source": "Bread machine recipe book, page 35"
    },
    {
      "id": "bread-glaze-egg",
      "category": "baking",
      "title": "Egg Glaze for Bread",
      "tip": "For a shiny golden crust, use Egg Glaze (mix 1 slightly beaten egg with 1 Tbsp. water or milk) or Egg Yolk Glaze (mix 1 slightly beaten egg yolk with 1 Tbsp. water or milk). Apply with pastry brush after rolls rise, just before baking.",
      "source": "Bread machine recipe book, page 35"
    },
    {
      "id": "bread-glaze-egg-white",
      "category": "baking",
      "title": "Egg White Glaze for Bread",
      "tip": "For a shiny chewy crust (lighter in color), use Egg White Glaze: Mix 1 slightly beaten egg white with 1 Tbsp. water. Apply with pastry brush after rolls rise, just before baking.",
      "source": "Bread machine recipe book, page 35"
    },
    {
      "id": "store-egg-yolk",
      "category": "storage",
      "title": "Storing Unused Egg Yolk",
      "tip": "To keep unused egg yolk fresh for several days, cover with cold water and store in refrigerator in a covered container.",
      "source": "Bread machine recipe book, page 35"
    },
    {
      "id": "shape-dinner-rolls",
      "category": "bread shaping",
      "title": "Easy Dinner Rolls Shaping",
      "tip": "Divide dough into 12 equal pieces, shape into balls and place in greased muffin cups. Cover, let rise and bake as directed.",
      "source": "Bread machine recipe book, page 36"
    },
    {
      "id": "shape-cloverleaves",
      "category": "bread shaping",
      "title": "Cloverleaf Rolls Shaping",
      "tip": "Makes 12. Lightly grease 12 muffin cups. Divide dough into 36 1-inch pieces. Pull edges under, smoothing tops to shape into balls. Place 3 balls in each muffin cup, smooth-side-up. Cover, let rise and bake as directed.",
      "source": "Bread machine recipe book, page 36"
    },
    {
      "id": "shape-pan-rolls",
      "category": "bread shaping",
      "title": "Simple Pan Rolls Shaping",
      "tip": "Makes 12. Lightly grease 8 x 1-1/2-inch, or 9 x 1-1/2 inch round baking pan. Divide dough into 12 pieces. Shape each piece into a ball, pulling edges under to make a smooth top. Arrange rolls smooth-side-up in prepared pan. Cover, let rise and bake as directed.",
      "source": "Bread machine recipe book, page 36"
    },
    {
      "id": "shape-swirls",
      "category": "bread shaping",
      "title": "Swirl Rolls Shaping",
      "tip": "Makes 10. Lightly grease baking sheet. Divide dough into 10 equal pieces. On a lightly floured surface, using your hand, roll each piece into a pencil-like strand about 10 inches long. Beginning at the center, continue wrapping each piece around the center to form a swirl. Place rolls 2-3 inches apart on prepared baking sheet. Cover, let rise and bake as directed.",
      "source": "Bread machine recipe book, page 36"
    },
    {
      "id": "shape-butterhorns",
      "category": "bread shaping",
      "title": "Butterhorns Shaping",
      "tip": "Makes 12. Lightly grease baking sheet. On lightly floured surface, roll dough into a 12-inch circle. Brush dough with melted butter. Cut into 12 wedges. To shape rolls, begin at wide end of wedge and roll toward point. Place rolls point side down, 2 to 3 inches apart, on prepared baking sheet. Cover, let rise and bake as directed.",
      "source": "Bread machine recipe book, page 36"
    },
    {
      "id": "reduce-rising-time",
      "category": "baking",
      "title": "Reduce Dough Rising Time",
      "tip": "Preheat conventional oven to 200°F/93°C for 5 minutes, then turn off oven. Shape dough, place on baking pan as directed and cover with a clean kitchen towel. Place dough in oven until doubled in size. This will reduce rising time by about one-half.",
      "source": "Bread machine recipe book, page 37"
    },
    {
      "id": "whole-grain-flour-rising",
      "category": "baking",
      "title": "Whole Grain Flour Rising",
      "tip": "Recipes using whole grain or unrefined flours contain less gluten and may not rise as much as those using white bread flour. As a result, these heavier breads may fall slightly in the center. This is normal and will not affect the taste. Wheat gluten can also be added to improve the shape and volume of bread made with low gluten flours.",
      "source": "Bread machine recipe book, page 37"
    },
    {
      "id": "keep-homemade-bread-fresh",
      "category": "storage",
      "title": "Keeping Homemade Bread Fresh",
      "tip": "There are no preservatives in your home made bread, so store cooled loaf in a tightly sealed plastic bag. If desired, enclose a stalk of celery in the bag to keep bread fresh longer. Do not store in the refrigerator as this causes bread to dry out faster.",
      "source": "Bread machine recipe book, page 37"
    }
  ]
}